jekyll/_posts/2019-08-28-five-minutes-of-dangerous-writing.html
---
layout: post
title: Five Minutes of Dangerous Writing
categories: misc
---

<div id="outline-container-org0a4f079" class="outline-2">
<h2 id="org0a4f079">Five Minutes of Dangerous Writing</h2>
<div class="outline-text-2" id="text-org0a4f079">
<p>
<i>Used <a href="https://maebert.github.io/themostdangerouswritingapp/#/">The Most Dangerous Writing App</a> to force some words out into the world. Written in one 5 minute session and left unedited.</i>
</p>

<p>
here's a thing, perhaps I will be saved by my lack of typing skills, since backspace seems to keep the timer ticking. The flow of words from my brain seems a little forced, but for five minutes I can see how my brain would not yet go blank. It is not as if I am being witty, I am simply dumping words onto the page in hopes that they do not go away. A weird sensation. Normally I do not know whether I would care whether or not the words go away, since normally my thoughts go aways regardless. Maybe the energy of typing them into the web page is what gives them value, since my fingers and wrist are liable to twinge from the extended effort. That makes me think that I really should investigate alternate typing modalities, since 5 minutes doesn't seem like the longest time to be continuously typing words&#x2026; maybe I will rekindle my interest in stenography&#x2026; after I complete the three million other things I've signed myself up for this season. I really do have too many hobbies. Too many vocations, even. Called in all directions with no where, ultimately to go. C'est lal vie, I suppose.
</p>
</div>
</div>
